### Задание 1

In [29]:
import pandas as pd

In [30]:
data = ([1, 'Тургенев'], [2, 'Чехов'], [3, 'Островский'])
columns = ['author_id', 'author_name']
authors = pd.DataFrame(data = data, columns = columns)

In [31]:
authors

   author_id author_name
0          1    Тургенев
1          2       Чехов
2          3  Островский

In [32]:
books = pd.DataFrame({'author_id':[1, 1, 1, 2, 2, 3, 3], 'book_title':['Отцы и дети', 'Рудин', 'Дворянское гнездо', 'Толстый и тонкий', 'Дама с собачкой', 'Гроза', 'Таланты и поклонники'], 'price':[450, 300, 350, 500, 450, 370, 290]})

In [33]:
books

   author_id            book_title  price
0          1           Отцы и дети    450
1          1                 Рудин    300
2          1     Дворянское гнездо    350
3          2      Толстый и тонкий    500
4          2       Дама с собачкой    450
5          3                 Гроза    370
6          3  Таланты и поклонники    290

### Задание 2

In [34]:
authors_price = pd.merge(authors, books, on = 'author_id', how = 'inner')

In [35]:
authors_price

   author_id author_name            book_title  price
0          1    Тургенев           Отцы и дети    450
1          1    Тургенев                 Рудин    300
2          1    Тургенев     Дворянское гнездо    350
3          2       Чехов      Толстый и тонкий    500
4          2       Чехов       Дама с собачкой    450
5          3  Островский                 Гроза    370
6          3  Островский  Таланты и поклонники    290

### Задание 3

In [36]:
top5 = authors_price.copy()

In [40]:
tp5 = top5.sort_values(by = 'price', inplace = True)

In [42]:
top5.tail(5)

   author_id author_name         book_title  price
2          1    Тургенев  Дворянское гнездо    350
5          3  Островский              Гроза    370
0          1    Тургенев        Отцы и дети    450
4          2       Чехов    Дама с собачкой    450
3          2       Чехов   Толстый и тонкий    500

### Задание 4

In [53]:
authors_stat = authors_price.groupby('author_name')

In [65]:
authors_stat.agg({'price': 'max'})

             price
author_name
Островский     370
Тургенев       450
Чехов          500